# Задание-3: "Перевёрнутая башня" (Задача олимпиадного уровня)
#
# Вавилонцы решили построить удивительную башню —
# расширяющуюся к верху и содержащую бесконечное число этажей и комнат.
# Она устроена следующим образом — на первом этаже одна комната,
# затем идет два этажа, на каждом из которых по две комнаты,
# затем идёт три этажа, на каждом из которых по три комнаты и так далее:
#         ...
#     12  13  14
#     9   10  11
#     6   7   8
#       4   5
#       2   3
#         1
#
# Эту башню решили оборудовать лифтом --- и вот задача:
# нужно научиться по номеру комнаты определять,
# на каком этаже она находится и какая она по счету слева на этом этаже.
#
# Входные данные: В первой строчке задан номер комнаты N, 1 ≤ N ≤ 2 000 000 000.
#
# Выходные данные:  Два целых числа — номер этажа и порядковый номер слева на этаже.
#
# Пример:
# Вход: 13
# Выход: 6 2
#
# Вход: 11
# Выход: 5 3

number = int(input('Please enter the number of room'))

counter_level = 1
counter_am_rooms = 1
current_room = 1
amount_levels = 1
flag = True

while flag:
    for i in range(counter_am_rooms):
        if current_room == number:
            flag = False
            print(counter_level)
            print(i+1)
            break
        current_room += 1
    amount_levels -= 1
    if amount_levels == 0:
        counter_am_rooms += 1
        amount_levels = counter_am_rooms
    counter_level += 1